<?php
class Forecast
{
    public static $cities = [
        "Київ", "Львів", "Одеса", "Харків", "Дніпро",
        "Запоріжжя", "Кривий Ріг", "Миколаїв", "Вінниця",
        "Херсон", "Полтава", "Чернігів", "Черкаси", "Суми",
        "Житомир", "Горлівка", "Маріуполь", "Луганськ",
        "Рівне", "Івано-Франківськ", "Тернопіль"
    ];

    // АБСОЛЮТНО ТОЧНИЙ СЛОВНИК (GPS КООРДИНАТИ)
    public static $apiCityMap = [
        "Київ" => "50.45,30.52",
        "Львів" => "49.84,24.03",
        "Одеса" => "46.48,30.73",
        "Харків" => "50.00,36.23",
        "Дніпро" => "48.46,35.04",
        "Запоріжжя" => "47.83,35.16",
        "Кривий Ріг" => "47.91,33.39",
        "Миколаїв" => "46.97,31.99",
        "Вінниця" => "49.23,28.46",
        "Херсон" => "46.63,32.61",
        "Полтава" => "49.58,34.55",
        "Чернігів" => "51.49,31.28",
        "Черкаси" => "49.44,32.05",
        "Суми" => "50.90,34.79",
        "Житомир" => "50.25,28.65",
        "Горлівка" => "48.33,38.05",
        "Маріуполь" => "47.09,37.54",
        "Луганськ" => "48.57,39.30",
        "Рівне" => "50.61,26.25",
        "Івано-Франківськ" => "48.92,24.71",
        "Тернопіль" => "49.55,25.59"
    ];
    
    public static $days = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця", "Субота", "Неділя"];
    public static $weather_status_icons = [
        '<h3 class="weather__item-status weather__item-status--sunny mb-4"><i class="bi bi-sun-fill"></i> Сонячно</h3>',
        '<h3 class="weather__item-status weather__item-status--grey mb-4"><i class="bi bi-cloud-fill"></i> Хмарно</h3>',
        '<h3 class="weather__item-status weather__item-status--grey mb-4"><i class="bi bi-cloud-drizzle-fill"></i> Дощ</h3>'
    ];
    public static $COOKIE_LIFETIME = 60 * 60 * 24 * 30;
}